# RebarHookLineLenFactor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarHookLineLenFactor Property
ParameterTypeId Class See Also
---
"Extension Multiplier"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarHookLineLenFactor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarHookLineLenFactor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarHookLineLenFactor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace